'use client';

import React from 'react';
import { useQuery } from '@tanstack/react-query';
import { useParams } from 'next/navigation';
import { Box, Center, Text } from '@mantine/core';
import { RichTextEditor, Link } from '@mantine/tiptap';
import { useEditor } from '@tiptap/react';
import StarterKit from '@tiptap/starter-kit';
import axiosInstance from '@/lib/axios';

// ที่ประชุมสภาฯ ไม่รับหลักการในวาระที่ ๑
const content = `
    <h2>บรรจุระเบียบวาระ</h2>
    <p>ชุดที่ ๒๖ ปีที่ ๑ ครั้งที่ ๑ (สมัยสามัญประจำปีครั้งที่สอง) วันพุธที่ ๑๓ ธันวาคม ๒๕๖๖</p>

    <h3>ที่ประชุมพิจารณา</h3>
    <p>ชุดที่ ๒๖ ปีที่ ๑ ครั้งที่ ๑๙ (สมัยสามัญประจำปีครั้งที่สอง) วันพุธที่ ๒๑ กุมภาพันธ์ ๒๕๖๗</p>

    <h3>มติ</h3>
    <p>ที่ประชุมสภาฯ ไม่รับหลักการในวาระที่ ๑</p>

    <h3>คะแนนเสียง</h3>
    <ul>
        <li>รับหลักการ: ๑๕๔ เสียง</li>
        <li>ไม่รับหลักการ: ๒๕๗ เสียง</li>
        <li>งดออกเสียง: ๑ เสียง</li>
        <li>ไม่ลงคะแนนเสียง: ๑ เสียง</li>
    </ul>
    <h3>ผู้เสนอ</h3>
    <ul>
        <li>๑. นายธัญวัจน์ กมลวงศ์วัฒน์ (ก้าวไกล)</li>
        <li>๒. นายพริษฐ์ วัชรสินธุ (ก้าวไกล)</li>
        <li>๓. นายวรภพ วิริยะโรจน์ (ก้าวไกล)</li>
        <li>๔. นายวิโรจน์ ลักขณาอดิศร (ก้าวไกล)</li>
        <li>๕. นายปกรณ์วุฒิ อุดมพิพัฒน์สกุล (ก้าวไกล)</li>
        <li>๖. นายปารเมศ วิทยารักษ์สรรค์ (ก้าวไกล)</li>
        <li>๗. นางสาวธิษะณา ชุณหะวัณ (ก้าวไกล)</li>
        <li>๘. นายสุรเชษฐ์ ประวีณวงศ์วุฒิ (ก้าวไกล)</li>
        <li>๙. นายสิทธิพล วิบูลย์ธนากุล (ก้าวไกล)</li>
        <li>๑๐. นายฉัตร สุภัทรวณิชย์ (ก้าวไกล)</li>
        <li>๑๑. นายกรุณพล เทียนสุวรรณ (ก้าวไกล)</li>
        <li>๑๒. เรืออากาศโทธนเดช เพ็งสุข (ก้าวไกล)</li>
        <li>๑๓. นายอภิสิทธิ์ ไล่สัตรูไกล (ก้าวไกล)</li>
        <li>๑๔. นายศิรสิทธิ์ สงนุ้ย (ก้าวไกล)</li>
        <li>๑๕. นางสาวปวิตรา จิตตกิจ (ก้าวไกล)</li>
        <li>๑๖. นายกัณตภณ ดวงอัมพร (ก้าวไกล)</li>
        <li>๑๗. นายปิยชาติ รุจิพรวศิน (ก้าวไกล)</li>
        <li>๑๘. นายศุทธสิทธิ์ พจน์ฐศักดิ์ (ก้าวไกล)</li>
        <li>๑๙. นางสาววรรณิดา นพสิทธิ์ (ก้าวไกล)</li>
        <li>๒๐. นายประสิทธิ์ ปัทมผดุงศักดิ์ (ก้าวไกล)</li>
        <li>๒๑. นางสาวกัลยพัชร รจิตโรจน์ (ก้าวไกล)</li>
        <li>๒๒. นายสกล สุนทรวาณิชย์กิจ (ก้าวไกล)</li>
        <li>๒๓. นายชัชวาล อภิรักษ์มั่นคง (ก้าวไกล)</li>
        <li>๒๔. นายชยพล สท้อนดี (ก้าวไกล)</li>
        <li>๒๕. นายเลาฟั้ง บัณฑิตเทอดสกุล (ก้าวไกล)</li>
        <li>๒๖. นางสาวพนิดา มงคลสวัสดิ์ (ก้าวไกล)</li>
        <li>๒๗. นายเฉลิมพงศ์ เเสงดี (ก้าวไกล)</li>
        <li>๒๘. นายวรายุทธ ทองสุข (ก้าวไกล)</li>
        <li>๒๙. นางสาวญาณธิชา บัวเผื่อน (ก้าวไกล)</li>
        <li>๓๐. นายสุภกร ตันติไพบูลย์ธนะ (ก้าวไกล)</li>
        <li>๓๑. นางสาวกมนทรรศน์ กิตติสุนทรสกุล (ก้าวไกล)</li>
        <li>๓๒. นางสาววรรณวิภา ไม้สน (ก้าวไกล)</li>
        <li>๓๓. นางสาวเบญจา แสงจันทร์ (ก้าวไกล)</li>
        <li>๓๔. นายสาธิต ทวีผล (ก้าวไกล)</li>
        <li>๓๕. นายอภิชาติ ศิริสุนทร (ก้าวไกล)</li>
        <li>๓๖. นายศักดินัย นุ่มหนู (ก้าวไกล)</li>
        <li>๓๗. นายคุณากร มั่นนทีรัย (ก้าวไกล)</li>
        <li>๓๘. นางสาวรักชนก ศรีนอก (ก้าวไกล)</li>
        <li>๓๙. นายคำพอง เทพาคำ (ก้าวไกล)</li>
        <li>๔๐. นายนิติพล ผิวเหมาะ (ก้าวไกล)</li>
        <li>๔๑. ว่าที่ร้อยตรีสมชาติ เตชถาวรเจริญ (ก้าวไกล)</li>
        <li>๔๒. นายชริน วงศ์พันธ์เที่ยง (ก้าวไกล)</li>
        <li>๔๓. นายชวาล พลเมืองดี (ก้าวไกล)</li>
        <li>๔๔. นางสาวพิมพ์กาญจน์ กีรติวิราปกรณ์ (ก้าวไกล)</li>
        <li>๔๕. นายกฤษฐ์หิรัญ เลิศอุฤทธิ์ภักดี (ก้าวไกล)</li>
        <li>๔๖. นางสาวพุธิตา ชัยอนันต์ (ก้าวไกล)</li>
        <li>๔๗. นางสาวเพชรรัตน์ ใหม่ชมภู (ก้าวไกล)</li>
        <li>๔๘. นายฐิติกันต์ ฐิติพฤฒิกุล (ก้าวไกล)</li>
        <li>๔๙. นายวุฒิพงศ์ ทองเหลา (ชาติพัฒนากล้า)</li>
        <li>๕๐. นางสาวรภัสสรณ์ นิยะโมสถ (ก้าวไกล)</li>
        <li>๕๑. นางสาวการณิก จันทดา (ก้าวไกล)</li>
        <li>๕๒. นายวีรนันท์ ฮวดศรี (ก้าวไกล)</li>
        <li>๕๓. นายณัฐวุฒิ บัวประทุม (ก้าวไกล)</li>
        <li>๕๔. นายสรพัช ศรีปราชญ์ (ก้าวไกล)</li>
        <li>๕๕. นายกิตติภณ ปานพรหมมาศ (ก้าวไกล)</li>
        <li>๕๖. นายจิรัฏฐ์ ทองสุวรรณ์ (ก้าวไกล)</li>
        <li>๕๗. นายชุติพงศ์ พิภพภิญโญ (ก้าวไกล)</li>
        <li>๕๘. นายวีรวุธ รักเที่ยง (ก้าวไกล)</li>
        <li>๕๙. นางสว่างจิตต์ เลาหะโรจนพันธ์ (ก้าวไกล)</li>
        <li>๖๐. นางปัญญารัตน์ นันทภูษิตานนท์ (ก้าวไกล)</li>
        <li>๖๑. นายวรท ศิริรักษ์ (ก้าวไกล)</li>
        <li>๖๒. นายคริษฐ์ ปานเนียม (ก้าวไกล)</li>
        <li>๖๓. นายฐากูร ยะแสง (ก้าวไกล)</li>
        <li>๖๔. นายชิษณุพงศ์ ตั้งเมธากุล (ก้าวไกล)</li>
        <li>๖๕. นายภูริวรรธก์ ใจสำราญ (ก้าวไกล)</li>
        <li>๖๖. นายณกร ชารีพันธ์ (ก้าวไกล)</li>
        <li>๖๗. นายสรวีย์ ศุภปณิตา (ก้าวไกล)</li>
        <li>๖๘. นายอิทธิพล ชลธราศิริ (ก้าวไกล)</li>
        <li>๖๙. นางสาวศศินันท์ ธรรมนิฐินันท์ (ก้าวไกล)</li>
        <li>๗๐. นายปรีติ เจริญศิลป์ (ก้าวไกล)</li>
        <li>๗๑. นายเกียรติคุณ ต้นยาง (ก้าวไกล)</li>
        <li>๗๒. นายเชตวัน เตือประโคน (ก้าวไกล)</li>
        <li>๗๓. นายนพดล ทิพยชล (ก้าวไกล)</li>
        <li>๗๔. นายเจษฎา ดนตรีเสนาะ (ก้าวไกล)</li>
        <li>๗๕. นายอนุสรณ์ แก้ววิเชียร (ก้าวไกล)</li>
        <li>๗๖. นายตรัยวรรธน์ อิ่มใจ (ก้าวไกล)</li>
        <li>๗๗. นายเซีย จำปาทอง (ก้าวไกล)</li>
        <li>๗๘. นายธีรัจชัย พันธุมาศ (ก้าวไกล)</li>
        <li>๗๙. นางสาวสิริลภัส กองตระการ (ก้าวไกล)</li>
        <li>๘๐. นางสาวศนิวาร บัวบาน (ก้าวไกล)</li>
        <li>๘๑. นางสาวชุติมา คชพันธ์ (ก้าวไกล)</li>
        <li>๘๒. นางทิพา ปวีณาเสถียร (ก้าวไกล)</li>
        <li>๘๓. นายจุลพงศ์ อยู่เกษ (ก้าวไกล)</li>
        <li>๘๔. นายณัฐพงษ์ เรืองปัญญาวุฒิ (ก้าวไกล)</li>
        <li>๘๕. นายกันต์พงษ์ ประยูรศักดิ์ (ก้าวไกล)</li>
        <li>๘๖. นายเอกราช อุดมอำนวย (ก้าวไกล)</li>
    </ul>
`;

const DraftState = () => {
  const { id, state } = useParams() as { id: string; state: string };
  const editor = useEditor({
    extensions: [StarterKit, Link],
    content,
  });

  const fetch = async () => {
    const res = await axiosInstance.get(`/raw/${id}`);
    return res.data;
  };

  const { data } = useQuery({
    queryKey: ['drafts', id, state],
    queryFn: () => fetch(),
  });

  return (
    <Box>
      {/* date and align right */}
      <Text
        style={{
          textAlign: 'right',
        }}
      >
        วันที่ ๑๓ ธันวาคม ๒๕๖๖
      </Text>
      <RichTextEditor
        editor={editor}
        style={{
          pointerEvents: 'none',
        }}
        p={16}
      >
        <RichTextEditor.Content />
      </RichTextEditor>
    </Box>
  );
};

export default DraftState;
