'use client';

import React from 'react';
import { useQuery } from '@tanstack/react-query';
import { useParams } from 'next/navigation';
import { Box, Center } from '@mantine/core';
import { RichTextEditor, Link } from '@mantine/tiptap';
import { useEditor } from '@tiptap/react';
import StarterKit from '@tiptap/starter-kit';
import axiosInstance from '@/lib/axios';

const content = `
  <html lang="th">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>ร่างพระราชบัญญัติการรับรองเพศ</title>
</head>
<body>
  <h1>ร่างพระราชบัญญัติการรับรองเพศ คำนำหน้านาม และการคุ้มครองบุคคลผู้มีความหลากหลายทางเพศ พ.ศ. ....</h1>
  <p><strong>ประเภท :</strong> เสนอโดยสมาชิกรัฐสภา ไม่ใช่ร่างการเงิน<br>
  <strong>เสนอโดย:</strong> นายธัญวัจน์ กมลวงศ์วัฒน์ สมาชิกสภาผู้แทนราษฎร ที่มาแนะนำ</p>

  <h2>สรุปสั้นๆ</h2>
  <p>โดยปัจจุบันยังไม่มีกฎหมายรับรองบุคคลผู้มีความหลากหลายทางเพศ จึงส่งผลให้เกิดการละเมิดศักดิ์ศรีความเป็นมนุษย์ สิทธิ เสรีภาพ และความเสมอภาคของบุคคลผู้มีความหลากหลายทางเพศ โดยกฎหมายไทยยังคงกำหนดให้ใช้คำนำหน้านาม ซึ่งถือตามเพศกำเนิด ได้แก่ เด็กชาย เด็กหญิง นาย นางสาว ส่งผลให้บุคคลข้ามเพศและผู้มีความหลากหลายทางเพศประสบปัญหาในการแสดงตัวตน การตัดสินใจกำหนดวิถีทางเพศ และการดำเนินชีวิต จึงสมควรมีกฎหมายดังกล่าวเพื่อมุ่งให้เกิดความคุ้มครองและรับรองสิทธิในเรื่องการใช้คำนำหน้านาม การระบุเพศของผู้มีความหลากหลายทางเพศตามหลักสิทธิมนุษยชน โดยร่างพระราชบัญญัติฉบับนี้แบ่งออกเป็น ๗ หมวด จำนวน ๔๔ มาตรา</p>

  <h2>รายละเอียด</h2>
  <p>ร่างพระราชบัญญัติการรับรองเพศ คำนำหน้านาม และการคุ้มครองบุคคลผู้มีความหลากหลายทางเพศ พ.ศ. .... นี้แบ่งออกเป็น ๗ หมวด จำนวน ๔๔ มาตรา ดังต่อไปนี้</p>
  <ol>
    <li>หมวด 1 หลักการและเหตุผล ความจำเป็นในการประกาศใช้และความมุ่งหมายของกฎหมายนี้</li>
    <li>หมวด 2 สิทธิและการคุ้มครองของบุคคลผู้มีความหลากหลายทางเพศในการเปลี่ยนแปลงข้อมูลเพศและคำนำหน้านาม บุคคลผู้มีความหลากหลายทางเพศ บุคคลผู้มีความหลากหลายทางเพศตามเจตจำนงค์ที่แสดงออก</li>
    <li>หมวด 3 สิทธิของบุคคลผู้มีความหลากหลายทางเพศในการตัดสินใจเลือกใช้คำนำหน้านามที่เหมาะสมกับตัวตนและความชอบของตนเอง สิทธิของบุคคลผู้มีความหลากหลายทางเพศในการกำหนดวิถีทางเพศของตนเอง</li>
    <li>หมวด 4 หน้าที่ของหน่วยงานและบุคคลในการรับรองและคุ้มครองบุคคลผู้มีความหลากหลายทางเพศ</li>
    <li>หมวด 5 หลักการพิจารณาและการตรวจสอบความถูกต้องและสมบูรณ์ของข้อมูลในการยืนยันเพศและคำนำหน้านาม</li>
    <li>หมวด 6 กระบวนการในการยื่นคำร้องและการออกคำสั่งทางปกครองในการรับรองและคุ้มครองบุคคลผู้มีความหลากหลายทางเพศ สิทธิและเสรีภาพของบุคคลผู้มีความหลากหลายทางเพศ</li>
    <li>หมวด 7 ขั้นตอนในการคุ้มครองสิทธิและเสรีภาพของบุคคลผู้มีความหลากหลายทางเพศในกรณีที่มีการละเมิดสิทธิและเสรีภาพ อำนาจหน้าที่ของหน่วยงานที่มีหน้าที่ในการให้บริการและดูแลบุคคลผู้มีความหลากหลายทางเพศ</li>
  </ol>

  <h2>ผู้ที่เกี่ยวข้อง</h2>
  <ol>
    <li>กรมการปกครอง กระทรวงมหาดไทย</li>
    <li>กระทรวงยุติธรรม และสำนักงานศาลยุติธรรม</li>
    <li>กรมสอบสวนคดีพิเศษ</li>
    <li>สำนักงานคณะกรรมการกฤษฎีกา</li>
    <li>สำนักงานตำรวจแห่งชาติ</li>
    <li>กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์</li>
    <li>สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน</li>
    <li>กรมส่งเสริมการปกครองท้องถิ่น</li>
    <li>กระทรวงสาธารณสุข</li>
    <li>กระทรวงวัฒนธรรม</li>
    <li>สำนักงานกองทุนการศึกษาเยาวชนเพื่อลดปัญหาความยากจน</li>
    <li>สมาคมเพื่อเพื่อน</li>
    <li>แพทยสภา</li>
    <li>สมาคมพยาบาลแห่งประเทศไทย</li>
    <li>มูลนิธิศูนย์ทนายความเพื่อสิทธิมนุษยชน</li>
    <li>มูลนิธิเพื่อสิทธิของผู้มีความหลากหลายทางเพศ</li>
  </ol>

    <h2>ประเด็นเพื่อรับฟังความคิดเห็น</h2>
  <ol>
    <li>ท่านเห็นด้วยหรือไม่กับการกำหนดนิยามคำว่าเพศสภาพ เพศวิถี อัตลักษณ์ทางเพศ เอกสารประกาศเจตจำนงอัตลักษณ์ทางเพศ บุคคลข้ามเพศ บุคคลเพศกำกวม หญิงข้ามเพศ ชายข้ามเพศ บุคคลผู้มีความหลากหลายทางเพศ บุคคลผู้มีความหลากหลายอัตลักษณ์ทางเพศ</li>
    <li>ท่านเห็นด้วยหรือไม่กับการกำหนดเกี่ยวกับการขอให้รับรองเพศ โดยให้บุคคลมีสิทธิขอให้มีการรับรองเพศตามเจตจำนงอัตลักษณ์ทางเพศ มีสิทธิใช้คำนำหน้านามและการขอให้ระบุเพศของตนที่ไม่ใช่เพศชายหรือเพศหญิง การขอให้รับรองเพศของบุคคลที่มีอายุต่ำกว่าสิบแปดปีบริบูรณ์</li>
    <li>ท่านเห็นด้วยหรือไม่กับกำหนดวิธีการดำเนินการ รายการเอกสาร และอื่น ๆ ที่เกี่ยวข้องกับการยื่นคำขอให้รับรองเพศ การระบุคำนำหน้านาม และการระบุเพศในเอกสารราชการ</li>
    <li>ท่านเห็นด้วยหรือไม่กับการกำหนดสิทธิ หน้าที่ และความรับผิดชอบของบุคคลข้ามเพศ และ/หรือ กำหนดสิทธิ หน้าที่ และความรับผิดชอบของบุคคลผู้มีความหลากหลายอัตลักษณ์ทางเพศ</li>
    <li>ท่านเห็นด้วยหรือไม่กับการกำหนดสิทธิในมาตรการส่งเสริมความเสมอภาคระหว่างเพศ</li>
    <li>ท่านเห็นด้วยหรือไม่กับการกำหนดเกี่ยวกับบุคคลที่มีเพศกำกวม ตั้งแต่ทารกที่คลอดออกมามีเพศกำกวม เด็กเพศกำกวม ไปจนถึงบุคคลเพศกำกวม ในด้านสิทธิต่าง ๆ</li>
    <li>ท่านเห็นด้วยหรือไม่กับการกำหนดให้มีบทลงโทษในการกระทำความผิดตามร่างพระราชบัญญัตินี้</li>
    <li>ข้อเสนอแนะอื่น ๆ</li>
  </ol>
</body>
</html>
  `;

const DraftState = () => {
  const { id, state } = useParams() as { id: string; state: string };
  const editor = useEditor({
    extensions: [StarterKit, Link],
    content,
  });

  const fetch = async () => {
    const res = await axiosInstance.get(`/raw/${id}`);
    return res.data;
  };

  const { data } = useQuery({
    queryKey: ['drafts', id, state],
    queryFn: () => fetch(),
  });

  return (
    <Center p={32}>
      <RichTextEditor
        editor={editor}
        style={{
          pointerEvents: 'none',
        }}
      >
        <RichTextEditor.Content />
      </RichTextEditor>
    </Center>
  );
};

export default DraftState;
